<?php

/*---------------------------------------
   公告事項 (分類式)
---------------------------------------*/   
$ann=3;  
       
//公告事項的子項目(中心公告,活動公告)
$annAry=array(15,16);

//中心公告的子項目(一般公告,交流活動,得獎專利,媒體報導)
$itemAry[15] =array(22,23,24,25);

//活動公告的子項目(展覽活動,工作坊,講座論壇,研討會)
$itemAry[16] =array(50,27,28,29);


/*---------------------------------------
   中心簡介 (分頁式)
---------------------------------------*/   
$intro=42;     
//中心簡介的子項目(沿革宗旨,組織架構,展覽空間,交通位置,表格下載)
$introAry=array(43,776,45,48);


/*---------------------------------------
   中心紀事 (分類式)
---------------------------------------*/   
$rec=39; 
//中心紀事的子項目(研究計畫,展演活動,推廣教育,交流活動)
$recAry=array(40,41,42,43);
//顯示方式list加小圖的項目
$recBoxType=array(41,42);

//展演活動的子項目(科技藝術表演,科技藝術展覽)
$itemAry[41] =array(44,45);

//推廣教育子項目(網路課程,工作坊,講座論壇,研討會)
$itemAry[42] =array(46,47,48,49);


/*---------------------------------------
   各實驗室 (分頁式)
---------------------------------------*/   
$lab =65; 
//實驗室的子項目(未來聲響實驗室,感知介面實驗室,超領域媒體實驗室)
$labAry=array(66,67,68);


/*---------------------------------------
   合作單位 (分頁式)
---------------------------------------*/   
$cooperation = 69;
//合作單位的子項目(資源贊助,合作團隊)
$cooperationAry=array(70,71);

/*---------------------------------------
   聯絡資訊 (分頁式)
---------------------------------------*/   
$contact = 781;
/*$contactAry=array(47);*/



//起始年份
$start_year = 1981;


/*---------------------------------------
   一些圖片的路徑 
   ex外掛相簿是 /wp-content/gallery/你命名的資料夾名稱/
   
   postImageType
   //gallery:就用外掛相簿的 or default:就是所用theme的"/images/"
---------------------------------------*/   
//分類
$catImageType="gallery";
$catImagePath="/wp-content/gallery/cat_image/";
//文章
$postImageType="gallery";
$postImagePath="/wp-content/gallery/post_image/";
//頁
$pageImageType="gallery";
$pageImagePath="/wp-content/gallery/page_image/";
//搜尋
$searchImageType="gallery";
$searchImagePath="/wp-content/gallery/search_image/";



/*---------------------------------------
   字數限制(後來改成css方式，這些變數就無用)
---------------------------------------*/   
$index_TCount=26;	 //首頁list無圖
$index_PCount=22; 	 //首頁list有圖
$archive_TCount=34;  //分類list無圖
$archive_PCount=26;  //分類list有圖



?>